EDT/УТ/src/DataProcessors/ОтменаЗаказов/ОтменаЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОтменаЗаказов</name>
  <attributes>
    <name>СписокЗаказов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СелекторТипаНомера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>МассоваяОперация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/ПривязкаМашинКРейсам/ПривязкаМашинКРейсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПривязкаМашинКРейсам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанВодитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанЭкспедитор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КтоПривязал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяПривязка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ТипыГрупповыхОперацийСЗаказами/ТипыГрупповыхОперацийСЗаказами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыГрупповыхОперацийСЗаказами</name>
  <enumValues>
    <name>ПереносЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ОтменаЗаказов</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/СтатусыГрупповойОперацииСЗаказом/СтатусыГрупповойОперацииСЗаказом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыГрупповойОперацииСЗаказом</name>
  <enumValues>
    <name>ДатаИзменена</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПропущена_ЗаказВыполнен</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПропущена_ЗаказУКурьера</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПропущена_ЗаказНеНайден</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПропущена_МножествоЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаВыполнена</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПропущена_ЗаказДоставлен</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПропущена_ЗаказНаСкладеНоБылВРейсе</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПропущена</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПропущена_ЗаказОтменен</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаПропущена_ЗаявкаОтклонена</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/Рейс/Рейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рейс</name>
  <registerRecords>InformationRegister.РейсыЗаказов</registerRecords>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТипыТранспортовВероут</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалетты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗагрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РейсМестнойДоставки</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>axi_Загрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленноеЗакрытиеРейса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_РаспределительныйЦентр</name>
    <type>
      <types>CatalogRef.РаспределительныеЦентрыVeeroute</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодикаМаршрутизации</name>
    <type>
      <types>EnumRef.МетодикаЛогистическойМаршрутизации</types>
    </type>
  </attributes>
  <attributes>
    <name>РольРейса</name>
    <type>
      <types>CatalogRef.РолиТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаРейса</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДоставок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаборов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Точки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасположения</name>
      <type>
        <types>EnumRef.ТипыРасположенияТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Широта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяВремяОтправления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеРасстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическийПробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияПоПлану</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапланированнаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяУбытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>CatalogRef.СтатусыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗаказа</name>
      <type>
        <types>EnumRef.ВидыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДобавленВРучную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдаленИзРейса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагруженИзВероут</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальнаяМаршрутизация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДобавленВЗапланированныйРейс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поездки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоездки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДистанция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяПродолжительностьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяНачалаПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяОкончанияПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Catalogs/API/API.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>API</name>
  <predefined>
    <items>
      <name>CasheServer</name>
      <description>Cashe server</description>
    </items>
    <items>
      <name>IntegrationService</name>
      <description>Integration service</description>
    </items>
    <items>
      <name>IntegrationService_v2</name>
      <description>Integration service (v.2)</description>
    </items>
    <items>
      <name>OZONE</name>
      <description>OZONE</description>
    </items>
    <items>
      <name>PPFM</name>
      <description>PP FM</description>
    </items>
    <items>
      <name>ScanServer</name>
      <description>Scan server</description>
    </items>
    <items>
      <name>smsc_ru</name>
      <description>smsc.ru</description>
    </items>
    <items>
      <name>Sync</name>
      <description>Sync</description>
    </items>
    <items>
      <name>Yandex_Route</name>
      <description>Yandex.Route</description>
    </items>
    <items>
      <name>ДМТранспортировки</name>
      <description>ДМ Транспортировки</description>
    </items>
  </predefined>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Логирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/DataProcessors/ОтменаЗаказов/ObjectModule.bsl
Функция ОтменитьЗаказы(ТаблицаНомеров) Экспорт
	
	ПоНомеруСтриж = СелекторТипаНомера = 1;
	
	ДатаОбработки = ТекущаяДата();
	
	ТаблицаНомеров.Свернуть("Номер");
	
	ТекстРазделитель =
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	МассивТекстов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаНомеров", ТаблицаНомеров);
	
	МассивТекстов.Добавить(
	"ВЫБРАТЬ
	|	ТаблицаНомеров.Номер КАК Номер
	|ПОМЕСТИТЬ ВТ_НомераЗаказов
	|ИЗ
	|	&ТаблицаНомеров КАК ТаблицаНомеров");
	
	МассивТекстов.Добавить(ТекстРазделитель);
	
	Если ПоНомеруСтриж Тогда
		МассивТекстов.Добавить(
		"ВЫБРАТЬ
		|	ВТ_НомераЗаказов.Номер КАК Номер,
		|	РеализацияТоваровУслуг.Ссылка КАК Заказ
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НомераЗаказов КАК ВТ_НомераЗаказов
		|		ПО РеализацияТоваровУслуг.Номер = ВТ_НомераЗаказов.Номер");
	Иначе
		Запрос.УстановитьПараметр("ВладелецТовара", Партнер);
		МассивТекстов.Добавить(
		"ВЫБРАТЬ
		|	ВТ_НомераЗаказов.Номер КАК Номер,
		|	РеализацияТоваровУслуг.Ссылка КАК Заказ
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НомераЗаказов КАК ВТ_НомераЗаказов
		|		ПО РеализацияТоваровУслуг.НомерВнешнегоЗаказа = ВТ_НомераЗаказов.Номер
		|			И (РеализацияТоваровУслуг.ВладелецТовара = &ВладелецТовара)");
	КонецЕсли;
	
	МассивТекстов.Добавить(ТекстРазделитель);
		
	МассивТекстов.Добавить(
	"ВЫБРАТЬ
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	МАКСИМУМ(РейсЗаказы.Ссылка.ДатаРейса) КАК ДатаРейса
	|ПОМЕСТИТЬ ВТ_МаксДатыРейсов
	|ИЗ
	|	Документ.Рейс.Заказы КАК РейсЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО РейсЗаказы.Заказ = ВТ_Заказы.Заказ
	|			И (НЕ РейсЗаказы.УдаленИзРейса)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Заказы.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаксДатыРейсов.Заказ КАК Заказ,
	|	ВТ_МаксДатыРейсов.ДатаРейса КАК ДатаРейса,
	|	МАКСИМУМ(РейсЗаказы.Ссылка.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_МаксДатыДокументаРейс
	|ИЗ
	|	Документ.Рейс.Заказы КАК РейсЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксДатыРейсов КАК ВТ_МаксДатыРейсов
	|		ПО РейсЗаказы.Заказ = ВТ_МаксДатыРейсов.Заказ
	|			И (НЕ РейсЗаказы.УдаленИзРейса)
	|			И РейсЗаказы.Ссылка.ДатаРейса = ВТ_МаксДатыРейсов.ДатаРейса
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МаксДатыРейсов.Заказ,
	|	ВТ_МаксДатыРейсов.ДатаРейса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МаксДатыДокументаРейс.Заказ КАК Заказ,
	|	МАКСИМУМ(РейсЗаказы.Ссылка) КАК Рейс
	|ПОМЕСТИТЬ ВТ_Рейсы
	|ИЗ
	|	Документ.Рейс.Заказы КАК РейсЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксДатыДокументаРейс КАК ВТ_МаксДатыДокументаРейс
	|		ПО РейсЗаказы.Заказ = ВТ_МаксДатыДокументаРейс.Заказ
	|			И (НЕ РейсЗаказы.УдаленИзРейса)
	|			И РейсЗаказы.Ссылка.ДатаРейса = ВТ_МаксДатыДокументаРейс.ДатаРейса
	|			И РейсЗаказы.Ссылка.Дата = ВТ_МаксДатыДокументаРейс.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МаксДатыДокументаРейс.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПривязкаМашинКРейсамСрезПоследних.Рейс КАК Рейс,
	|	ПривязкаМашинКРейсамСрезПоследних.Транспорт КАК Транспорт,
	|	ПривязкаМашинКРейсамСрезПоследних.Водитель КАК Водитель,
	|	ПривязкаМашинКРейсамСрезПоследних.Экспедитор КАК Экспедитор
	|ПОМЕСТИТЬ ВТ_Экипажи
	|ИЗ
	|	РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних(
	|			,
	|			Рейс В
	|				(ВЫБРАТЬ
	|					ВТ_Рейсы.Рейс КАК Рейс
	|				ИЗ
	|					ВТ_Рейсы КАК ВТ_Рейсы)) КАК ПривязкаМашинКРейсамСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НомераЗаказов.Номер КАК Номер,
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	ВТ_Рейсы.Рейс.Номер КАК НомерРейса,
	|	ВТ_Рейсы.Рейс.ДатаРейса КАК ДатаРейса,
	|	ВТ_Экипажи.Транспорт.Наименование КАК Транспорт,
	|	ВТ_Экипажи.Водитель.Наименование КАК Водитель,
	|	ВТ_Экипажи.Экспедитор.Наименование КАК Экспедитор,
	|	НЕ ВТ_Рейсы.Рейс ЕСТЬ NULL КАК ВРейсе,
	|	РеализацияТоваровУслуг.Номер КАК НомерСтриж,
	|	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК ВнешнийНомер,
	|	РеализацияТоваровУслуг.ВладелецТовара КАК ВладелецТовара
	|ИЗ
	|	ВТ_НомераЗаказов КАК ВТ_НомераЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Рейсы КАК ВТ_Рейсы
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Экипажи КАК ВТ_Экипажи
	|				ПО ВТ_Рейсы.Рейс = ВТ_Экипажи.Рейс
	|			ПО ВТ_Заказы.Заказ = ВТ_Рейсы.Заказ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ПО ВТ_Заказы.Заказ = РеализацияТоваровУслуг.Ссылка
	|		ПО ВТ_НомераЗаказов.Номер = ВТ_Заказы.Номер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер");
	
	Запрос.Текст = СтрСоединить(МассивТекстов);
	
	ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();
	
	КоличествоВсего = ТаблицаЗаказов.Количество();
	
	СтрокиЗаказов = ТаблицаЗаказов.НайтиСтроки(Новый Структура("Заказ", Null));
	
	КоличествоНенайденных = СтрокиЗаказов.Количество();
	КоличествоНайденных = КоличествоВсего - КоличествоНенайденных;
		
	Для Каждого СтрокаЗаказа Из СтрокиЗаказов Цикл
		Сообщить("Не найден заказ " + СтрокаЗаказа.Номер);
	КонецЦикла;
	
	Если Не КоличествоНайденных Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если КоличествоНайденных > 100 И Не МассоваяОперация Тогда
		Сообщить("Массовая операция (> 100 заказов) не разрешена");
		Возврат Неопределено;
	КонецЕсли;
	
	//Сообщить("Процесс отмены...");
	//Возврат Неопределено;
	
	СтрокиЗаказов = ТаблицаЗаказов.НайтиСтроки(Новый Структура("ВРейсе", Истина));
	Если СтрокиЗаказов.Количество() Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		
		Макет = Обработки.ОтменаЗаказов.ПолучитьМакет("ЗаказыВРейсе");
		
		Область = Макет.ПолучитьОбласть("Шапка");
		ПараметрыОбласти = Область.Параметры;
		ПараметрыОбласти.Дата = ДатаОбработки;
		ТабДок.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Строка");
		ПараметрыОбласти = Область.Параметры;
		
		Для Каждого СтрокаЗаказа Из СтрокиЗаказов Цикл
			ПараметрыОбласти.Заполнить(СтрокаЗаказа);
			ПараметрыОбласти.НомерСтриж = СокрЛП(ПараметрыОбласти.НомерСтриж);
			ТабДок.Вывести(Область);
		КонецЦикла;
		
		ТемаПисьма = "Заказы в рейсе " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy");
		ТекстПисьма = "Заказы в рейсе " + ДатаОбработки;
		
		ИмяФайла = КаталогВременныхФайлов() + "ЗаказыВРейсе" + Формат(ДатаОбработки, "ДФ=ddMMyyHHmmss") + ".xls";
		
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);
		
		МассивПолучателей = Новый Массив;
		Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
			МассивПолучателей.Добавить("m.aseev@strizh-logistic.ru");
		Иначе
			МассивПолучателей.Добавить("m.aseev@strizh-logistic.ru");
			МассивПолучателей.Добавить("dmitry.sherbinkin@strizh-logistic.ru");
			МассивПолучателей.Добавить("logist@strizh-logistic.ru");
		КонецЕсли;
		
		lem.ОтправитьСообщение(МассивПолучателей, ТемаПисьма, ТекстПисьма, ИмяФайла);
		//Сообщить("Отправка письма закомментирована: " + ТемаПисьма);
		
		Попытка
			УдалитьФайлы(ИмяФайла);
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	КолонкиТаблицы = ТаблицаЗаказов.Колонки;
	КолонкиТаблицы.Добавить("ОбработкаПропущена", Новый ОписаниеТипов("Булево"));
	КолонкиТаблицы.Добавить("РезультатAPI");
	КолонкиТаблицы.Добавить("ОписаниеОшибки", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(0));
	
	Фиксация = Документы.ФиксацияГрупповойОперацииСЗаказами.СоздатьДокумент();
	Фиксация.ТипГрупповойОперации = Перечисления.ТипыГрупповыхОперацийСЗаказами.ОтменаЗаказов;
	
	Фиксация.Дата = ДатаОбработки;
	Фиксация.СелекторТипаНомера = СелекторТипаНомера;
	Фиксация.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Фиксация.Партнер = Партнер;
	Фиксация.Комментарий = Комментарий;
	Фиксация.ИнициаторСостояния = ИнициаторСостояния;
	Фиксация.ПричинаОтказаПереноса = ПричинаОтказаПереноса;
	
	ОбработкаВыполнена = Перечисления.СтатусыГрупповойОперацииСЗаказом.ОбработкаВыполнена;
	ОбработкаПропущена = Перечисления.СтатусыГрупповойОперацииСЗаказом.ОбработкаПропущена;
	
	//Асеев 25.01.2022 (Задача № 4975)>>>
	//СтруктураДоступаSync = Новый Структура("Логин,Пароль", "backoffice", "E146THy");
	reasonId = ПричинаОтказаПереноса.Код;
	who = СокрЛП(ПараметрыСеанса.ТекущийПользователь);
	//Асеев 25.01.2022 (Задача № 4975)<<<
	
	Для Каждого СтрокаЗаказа Из ТаблицаЗаказов Цикл
		
		Если СтрокаЗаказа.Заказ <> Null Тогда
			
			//Асеев 25.01.2022 (Задача № 4975)>>>
			//РезультатAPI = Неопределено;
			//
			//Попытка
			//	//ВызватьИсключение "тест_ошибка";
			//	РезультатAPI = ИнтеграцияССервисомSync.RefuseOrder(Число(СтрокаЗаказа.НомерСтриж), СтруктураДоступаSync);
			//Исключение
			//	СтрокаЗаказа.ОписаниеОшибки = ОписаниеОшибки();
			//КонецПопытки;
			//
			//СтрокаЗаказа.РезультатAPI = РезультатAPI;
			//
			//СтрокаФиксации = Фиксация.Заказы.Добавить();
			//СтрокаФиксации.Заказ = СтрокаЗаказа.Заказ;
			//
			//Если РезультатAPI = 1 Тогда
			//	СтрокаФиксации.Статус = ОбработкаВыполнена;
			//Иначе
			//	СтрокаФиксации.Статус = ОбработкаПропущена;
			//	СтрокаЗаказа.ОбработкаПропущена = Истина;
			//КонецЕсли;
			
			ПараметрыЗапроса = Новый Структура("orderId,reasonId,who", Число(СтрокаЗаказа.НомерСтриж), reasonId, who);
			
			СтруктураВозврата = ИнтеграцияСАдминкойWEBСервис.ВыполнитьЗапросКАдминке("cancelOrder", ПараметрыЗапроса,,,, Справочники.API.IntegrationService_v2);
			
			РезультатAPI = Неопределено;
			ОписаниеОшибки = Неопределено;
			Если СтруктураВозврата.Успешно Тогда
				СтруктураВозврата.Данные.Свойство("error", ОписаниеОшибки);
				Если ОписаниеОшибки <> Неопределено Тогда
					РезультатAPI = ОписаниеОшибки;
				КонецЕсли;
			Иначе
				ОписаниеОшибки = СтруктураВозврата.ОписаниеОшибки;
			КонецЕсли;
			
			СтрокаЗаказа.ОписаниеОшибки = ОписаниеОшибки;
			СтрокаЗаказа.РезультатAPI = РезультатAPI;
			
			СтрокаФиксации = Фиксация.Заказы.Добавить();
			СтрокаФиксации.Заказ = СтрокаЗаказа.Заказ;
			
			Если ОписаниеОшибки = Неопределено Тогда
				СтрокаФиксации.Статус = ОбработкаВыполнена;
			Иначе
				СтрокаФиксации.Статус = ОбработкаПропущена;
				СтрокаЗаказа.ОбработкаПропущена = Истина;
			КонецЕсли;
			//Асеев 25.01.2022 (Задача № 4975)<<<
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокиЗаказов = ТаблицаЗаказов.НайтиСтроки(Новый Структура("ОбработкаПропущена", Истина));
	Если СтрокиЗаказов.Количество() Тогда
		
		ТемаПисьма = "Заказы, по которым невозможна отмена " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy");
		
		ТекстПисьма = Новый Массив;
		ТекстПисьма.Добавить("Заказы, по которым невозможна отмена " + ДатаОбработки);
		ТекстПисьма.Добавить("");
		Для Каждого СтрокаЗаказа Из СтрокиЗаказов Цикл
			//Асеев 25.01.2022 (Задача № 4975)>>>
			//Если СтрокаЗаказа.РезультатAPI <> Неопределено Тогда
			//	ТекстПисьма.Добавить("По заказу " + СокрЛП(СтрокаЗаказа.НомерСтриж) + " ответ метода RefuseOrder API: " + СтрокаЗаказа.РезультатAPI);
			//Иначе
			//	ТекстПисьма.Добавить("По заказу " + СокрЛП(СтрокаЗаказа.НомерСтриж) + " ошибка вызова метода RefuseOrder API: " + СтрокаЗаказа.ОписаниеОшибки);
			//КонецЕсли;
			Если СтрокаЗаказа.РезультатAPI <> Неопределено Тогда
				ТекстПисьма.Добавить("По заказу " + СокрЛП(СтрокаЗаказа.НомерСтриж) + " ответ метода cancelOrder API: " + СтрокаЗаказа.РезультатAPI);
			Иначе
				ТекстПисьма.Добавить("По заказу " + СокрЛП(СтрокаЗаказа.НомерСтриж) + " ошибка вызова метода cancelOrder API: " + СтрокаЗаказа.ОписаниеОшибки);
			КонецЕсли;
			//Асеев 25.01.2022 (Задача № 4975)<<<
		КонецЦикла;
		
		ТекстПисьма = СтрСоединить(ТекстПисьма, Символы.ПС);
		
		МассивПолучателей = Новый Массив;
		Если ПараметрыСеанса.ЭтоТестоваяСреда Тогда
			МассивПолучателей.Добавить("m.aseev@strizh-logistic.ru");
		Иначе
			МассивПолучателей.Добавить("m.aseev@strizh-logistic.ru");
			МассивПолучателей.Добавить("dmitry.sherbinkin@strizh-logistic.ru");
			МассивПолучателей.Добавить("logist@strizh-logistic.ru");
		КонецЕсли;
		
		lem.ОтправитьСообщение(МассивПолучателей, ТемаПисьма, ТекстПисьма);
		
	КонецЕсли;
	
	Фиксация.Записать();
	
	Возврат Фиксация.Ссылка;
	
КонецФункции
